const { ipcRenderer } = require('electron');


let uiController = ( () => {
    // 1. DOMooc элементүүдийг шүүж авах хэсэг

    // 2. List-үүдыг callback-аар давтах функц

    // 3. Мөнгийг таслалал, нэмэх хасах тэмдэгээр форматлах

    // 4. Буцаах Public service-үүдээ энд бичнэ

    return {
        // 1. Он сарыг дэлгэцэнд гаргах public функц энд бичигдэнэ

        // 2. Орлого зарлагыг солих үед талбаруудын өнгийг өөрчлөх функцийг энд бичнэ

        // 3. Талбаруудад бичсэн утгуудыг энд бичсэн функцээс буцааж авна

        // 4. Зарлагын листүүд дээр хувиудыг тавих функцийг энд бичнэ

        // 5. DOM элементүүдийг буцаар функцийг энд бичнэ

        // 6. Талбаруудыг цэвэрлэх функцуудын энд бичнэ

        // 7. Нийт орлого зарлага, төсвийг хувьтай нь дэлгэцэнд гаргах функцыг энд бичнэ

        // 8. Орлого зарлагын листүүдыг DOM-оос олж устгах функцуудыг энд бичнэ

        // 9. Орлого зарлагын утгуудыг DOM дээр нэмэх функцыг энд бичнэ
    }
} )();


// Санхүүтэй ажиллах модуль
let financeController = ( () => {

    // Орлого зарлагын байгуулагч функц буюу классуудыг энд бичнэ

    // Мөн тэдгээр классууд дээр хувь тооцоорох ба тооцоолсон хувиа буцаадаг функцуудыг тус тус бичнэ

    // Энд нийт орлого ба зарлагын дүнг тооцоолдог функцыг бичнэ

    // Энд Орлого зарлагын утгуудыг хадгалдаг массивтай обьект, Нийт орлого зарлагын дүнг хадгалдаг обьект, нийт төсөв хувийг хадгалдаг хувьсагчтай нэг том обьектийг бичнэ

    // Энд public servive буцаах обьект бичигдэнэ.
    return {
        // Энд нийт төсвийг тооцоолдог болон зарлагын хувийг тооцоолдог функцийг бичнэ

        // Энд зарлагын обьект тус бүр өөрсдийнхөө хувийг тооцоолдог функцийг бичнэ

        // Энд шинэ массивт бүх зарлагын хувиадаа хийгээд буцаадаг функц хийнэ

        // Нийт төсөв, зарлагын хувь, орлого зарлагын массивийг буцаах функцийг энд бичнэ.

        // Орлого зарлагын массиваас элементийг устгах функцийг энд бичнэ

        // Орлого ба зарлагын массив дээр элемент нэмэх функцийг энд бичнэ
    }

} )();

let appController = ( (uiController, financeController) => {
    // Орлого зарлагын лист дээр элемент нэмэх функцийг энд бичнэ

    // Төсвийн мэдээллийг дахин бодож, шинэчилдэг функцийг энд бичнэ

    // App-ийн бүх эвент листенерүүдийг дууддаг функцийг энд бичнэ.

    // Эндээс public service эхэлж байна.

    return {
        // App-ийн үйл ажиллагааг дуудаж эхлүүлдэг функцыг энд бичнэ
    }
} )(uiController, financeController);

// Эхлүүлэх функцийг энд дуудна.